//================================================================================================================
//
// DirectXのデバッグ表示用ヘッダファイル [billboard.h]
// Author : KOMATSU SHOTA
//
//================================================================================================================
#ifndef _BILLBOARD_H_
#define _BILLBOARD_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** 構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXMATRIX mtxWorld;	// マトリックス
	float fWidth;			// 幅
	float fHeight;			// 高さ
	int texID;				// 種類
	bool bUse;				// 使用しているかどうか
} BILLBOARD;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitBillboard(void);
void UninitBillboard(void);
void UpdateBillboard(void);
void DrawBillboard(void);

void SetBillboard(D3DXVECTOR3 pos, float fWidth, float fHeight,int texID);

#endif