//==================================================================================
//
// COLOR関連マクロ定義ヘッダファイル [Color_defs.h]
// Author : TENMA
// DATE : 2026/03/10
//
//==================================================================================
#ifndef _COLOR_DEFS_H_		// インクルードガード
#define _COLOR_DEFS_H_

//**********************************************************************************
//*** インクルード関連 ***
//**********************************************************************************
#include "d3dx9math.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define COLOR_WHITE				(D3DXCOLOR(1, 1, 1, 1))					// 基本色
#define COLOR_NONE				(D3DXCOLOR(0, 0, 0, 0))					// 無色
#define COLOR_INV				(D3DXCOLOR(1, 1, 1, 0))					// 透明

#define COLOR_FILL(elem)		(D3DXCOLOR(elem, elem, elem, elem))		// 指定色

#define COLOR_ALPHA(col, a)		(D3DXCOLOR(col.r, col.g, col.b, a))		// alpha値のみ変換

#endif