//==================================================================================
//
// DirectXのダイアログのソースファイル [dialog.cpp]
// Author : TENMA
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "dialog.h"

// 汎用インクルード群
#include "Texture.h"
#include "2Dpolygon.h"
#include "mathUtil.h"
#include "param.h"

USE_PARAM;

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define DIALOG_NUM		(2)		// ダイアログボックスの数

//**********************************************************************************
//*** ダイアログボックス構造体 ***
//**********************************************************************************
STRUCT()
{
	D3DXVECTOR3 BoxMid;		// ボックスの中心
	D3DXVECTOR2 BoxSize;	// ボックスのサイズ
	IDX_TEX tex;			// テクスチャのインデックス
	IDX_2DPOLYGON polygon;	// ポリゴンのインデックス
} Dialog;

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
Dialog g_aDialog[DIALOG_NUM];
Dialog g_aDialogInfo[DIALOG_NUM] =
{
	{D3DXVECTOR3(CParamVector::WINMID.x, CParamVector::WINMID.y * 1.5f, 0.0f), D3DXVECTOR2(1280.0f, 400.0f), -1, -1},
	{D3DXVECTOR3(CParamVector::WINMID.x, CParamVector::WINMID.y * 1.5f, 0.0f), D3DXVECTOR2(1280.0f, 400.0f), -1, -1},
};

const char *g_apDialogTexture[DIALOG_NUM] =
{
	"data/TEXTURE/.jpg",
	"data/TEXTURE/.jpg",
};

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitDialog(void)
{
	memcpy(&g_aDialog[0], &g_aDialogInfo[0], sizeof(Dialog) * DIALOG_NUM);

	// 値をコピー
	for (int nCntDialog = 0; nCntDialog < DIALOG_NUM; nCntDialog++)
	{
		g_aDialog[nCntDialog].BoxMid = D3DXVECTOR3(CParamVector::WINMID.x, CParamVector::WINMID.y * 1.5f, 0.0f);
	}
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitDialog(void)
{
	
}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateDialog(void)
{
	
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void DrawDialog(void)
{
	
}

//==================================================================================
// --- 設置 ---
//==================================================================================
void SetDialog(void)
{
	for (int nCntDialog = 0; nCntDialog < DIALOG_NUM; nCntDialog++)
	{
		// テクスチャの読み込み
		LoadTexture(g_apDialogTexture[nCntDialog], &g_aDialog[nCntDialog].tex);

		// 2Dポリゴンの設置
		g_aDialog[nCntDialog].polygon = Set2DPolygon(g_aDialog[nCntDialog].BoxMid,
			CParamVector::V3NULL,
			g_aDialog[nCntDialog].BoxSize,
			g_aDialog[nCntDialog].tex);
	}
}