//================================================================================================================
//
// 自分で使う用のマクロ [endomacro.h]
// Author : Endo Hideto
//
//================================================================================================================
#ifndef _ENDOMACRO_H_
#define _ENDOMACRO_H_

//==============================================================
// ヘッダーインクルード
#include "main.h"

//=========================================================================================
// マクロ定義
//=========================================================================================
#define vec2		D3DXVECTOR2
#define vec3		D3DXVECTOR3
#define vec3_ZERO	D3DXVECTOR3(0.0f,0.0f,0.0f)
#define POINTER(mold,name)			typedef struct mold* name			// (mold) のポインタ型の (name) を定義する
#define MIDCHECK(MIN,N,MAX)			(MIN < N && N < MAX)				// 最小最大のチェック
#define SQUARE(X)					((X) * (X))							// ２乗
#define __ABSOLUTE(X)				(X < 0 ? X* -1:X)					// 絶対値


#endif // !_ENDOMACRO_H_