//================================================================================================================
//
// DirectXのビルボード爆発表示用ヘッダファイル [explosion.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _EXPLOSION_H_
#define _EXPLOSION_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include "input.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitExplosion(void);
void UninitExplosion(void);
void UpdateExplosion(void);
void DrawExplosion(void);

void SetExplosion(D3DXVECTOR3 pos, float fWidth, float fHeight, int nSpeedAnim);
void SetExplosionEx(D3DXVECTOR3 pos, D3DXVECTOR3 move, float fSpd, float fWidth, float fHeight, int nSpeedAnim);
#endif