//================================================================================================================
//
// DirectXのゲームフィールド表示用ヘッダファイル [field.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _FIELD_H_
#define _FIELD_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitField(void);
void UninitField(void);
void UpdateField(void);
void DrawField(void);

void SetField(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXVECTOR3 rot, float fWidth, float fDepth, int nIndexTexture, int nXblock, int nZblock, D3DCULL type);
bool CollisionFloor(D3DXVECTOR3* pPos, D3DXVECTOR3* pPosOld, D3DXVECTOR3* pMove, float fHeight);
#endif