//================================================================================================================
//
// DirectXのゲーム用のヘッダーファイル [game.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _GAME_H_
#define _GAME_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define DEFAULT_WAITING		(120)		// デフォルトの移行待機時間

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
void SetEnablePause(bool bPouse);

void SetGameEnding(int nCountWait = DEFAULT_WAITING);
bool GetEnableUI(void);
bool GetEnablePause(void);
int GetIdxShopPrompt(void);
int GetScore(void);		// スコア(タイム)情報の譲渡

#endif
