//==================================================================================
//
// DirectXのゲーム関連用のcppファイル [game.cpp]
// Author : TENMA
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "input.h"
#include "camera.h"
#include "fade.h"
#include "model.h"
#include "modeldata.h"
#include "Texture.h"
#include "3Dmodel.h"
#include "field.h"
#include "light.h"
#include "thread.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
int g_nIdx3DModel;		// 設置した3Dモデルのインデックス
int g_nIdxCamera;		// 設置したカメラのインデックス

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitGame(void)
{
	/*** Aの初期化 ***/

	/*** カメラの初期化 ***/
	InitCamera();

	/*** モデルデータの初期化 ***/
	InitModelData();

	/*** テクスチャの初期化 ***/
	InitTexture();

	/*** 3Dモデルの初期化 ***/
	Init3DModel();

	/*** 床の初期化 ***/
	InitField();

	/*** モデルの初期化 ***/
	InitModel();

	/*** ライトの初期化 ***/
	InitLight();

	/*** Xファイルの読み込み ***/
	int nIdxModelData;		// モデルデータへのインデックス
	if (SUCCEEDED(LoadModelData("data/MODEL/XmasTree.x", &nIdxModelData)))
	{
		// モデルデータ使用した3Dモデルの配置
		g_nIdx3DModel = Set3DModel(D3DXVECTOR3_NULL, D3DXVECTOR3_NULL, nIdxModelData);
	}

	/*** モデルのスクリプト読み込み ***/
	LoadModel();

	/*** テクスチャの読み込み ***/
	int nIdxTexture;
	LoadTexture("data\\TEXTURE\\sea000.jpg", &nIdxTexture);

	/*** 床設置 ***/
	SetField(D3DXVECTOR3_NULL, D3DXVECTOR3_NULL, D3DXVECTOR3_NULL, 1000.0f, 1000.0f, nIdxTexture, 16, 16, D3DCULL_CCW);
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitGame(void)
{
	/*** Aの終了 ***/

	/*** カメラの終了 ***/
	UninitCamera();

	/*** モデルデータの終了 ***/
	UninitModelData();

	/*** テクスチャの終了 ***/
	UninitTexture();

	/*** 3Dモデルの終了 ***/
	Uninit3DModel();

	/*** 床の終了 ***/
	UninitField();

	/*** モデルの終了 ***/
	UninitModel();

	/*** ライトの終了 ***/
	UninitLight();
}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateGame(void)
{
	// モード変更
	if (GetKeyboardTrigger(DIK_RETURN)
		|| GetJoypadTrigger(0, JOYKEY_A)
		|| GetJoypadTrigger(0, JOYKEY_START))
	{
		if (GetFade() == FADE_NONE)
		{
			SetFade(MODE_TITLE);
		}
	}

	/*** Aの更新 ***/

	/*** カメラの更新 ***/
	UpdateCamera();

	/*** 3Dモデルの更新 ***/
	Update3DModel();

	/*** 床の更新 ***/
	UpdateField();

	/*** モデルの更新 ***/
	UpdateModel();

	/*** ライトの更新 ***/
	UpdateLight();
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void DrawGame(void)
{
	// カメラの数分だけ描画
	for (int nCntDraw = 0; nCntDraw < GetCameraNum(); nCntDraw++)
	{		
		/*** カメラの設置 ***/
		SetCamera();

		// VERTEX_3D ============================================
		/*** Aの描画 ***/

		/*** 3Dモデルの描画 ***/
		Draw3DModel();

		/*** モデルの描画 ***/
		DrawModel();

		/*** 床の描画  ***/
		DrawField();

		// VERTEX_2D ============================================
		/*** Aの描画 ***/
	}
}