//==================================================================================
//
// DirectXのギミック処理 [gimmick.h]
// Author : TENMA
//
//==================================================================================
#ifndef _GIMMICK_H_		// IncludeGuard
#define _GIMMICK_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** ギミックタイプ ***
//**********************************************************************************
typedef enum
{
	GIMMICKTYPE_LOCKDOOR = 0,		// 鍵付きドア
	GIMMICKTYPE_MAX
}GIMMICKTYPE;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitGimmick(void);
void UninitGimmick(void);
void UpdateGimmick(void);
void DrawGimmick(void);

void SetGimmick(D3DXVECTOR3 pos, D3DXVECTOR3 rot, GIMMICKTYPE type);
void ClearGimmick(GIMMICKTYPE type);
bool IsClearGimmick(GIMMICKTYPE type);
bool CollisionGimmick(D3DXVECTOR3 *pPos, D3DXVECTOR3 *pPosOld, D3DXVECTOR3 *pMove);
#endif	// !_GIMMICK_H_