//==================================================================================
//
// DirectXのノーマルエンド用のcppファイル [normalend.cpp]
// Author : Shu Tanaka
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "normalend.h"
#include "texture.h"
#include "mycol.h"
#include "mathutil.h"
#include "vector_defs.h"
#include "2Dpolygon.h"

using namespace MyMathUtil;

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define TEX_NORMALEND		(2)		// バッドエンドの際に使うテクスチャ数	

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
IDX_2DPOLYGON g_nIdxNResultPolygon[TEX_NORMALEND];	// 2Dポリゴンのインデックスを保管
int g_nCounterNormal = 0;

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitNormalEnd(void)
{
	int Tex;

	LoadTexture("data/TEXTURE/result.png", &Tex);
	g_nIdxNResultPolygon[0] = Set2DPolygon(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f), VECNULL, D3DXVECTOR2(1280, 720), Tex, DEF_COL);

	LoadTexture("data/TEXTURE/Clockneedle.png", &Tex);
	g_nIdxNResultPolygon[1] = Set2DPolygon(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f), VECNULL, D3DXVECTOR2(100, 100), Tex, DEF_COL);
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitNormalEnd(void)
{

}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateNormalEnd(void)
{
	g_nCounterNormal++;

	static float fRotate = 0.0f;

	if (g_nCounterNormal % 10 == 0)
	{
		fRotate -= 0.01f;
	}

	fRotate = RepairRot(fRotate);

	SetRotation2DPolygon(g_nIdxNResultPolygon[1], fRotate);
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void DrawNormalEnd(void)
{

}