//==================================================================================
//
// DirectXのガイドプロンプト表示処理 [prompt.h]
// Author : TENMA
//
//==================================================================================
#ifndef _PROMPT_H_		// IncludeGuard
#define _PROMPT_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define MAX_PROMPT		(64)		// プロンプトの最大同時出現数

//**********************************************************************************
//*** プロンプト構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR2 size;		// サイズ
	D3DXMATRIX mtxWorld;	// ワールドマトリックス
	int nIdxTexture;		// テクスチャインデックス
	bool bUse;				// 使用状況
	bool bDisp;				// 描画するか
} Prompt, * LPPROMPT;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitPrompt(void);
void UninitPrompt(void);
void UpdatePrompt(void);
void DrawPrompt(void);

int SetPrompt(void);
void SetEnablePrompt(bool bDisp, int nIdxPrompt);
D3DXVECTOR3 GetPromptPos(int nIdxPrompt);
LPPROMPT GetPrompt(void);
#endif