//==================================================================================
//
// DirectXのリザルト関連用のcppファイル [Result.cpp]
// Author : TENMA
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "Result.h"
#include "input.h"
#include "fade.h"
#include "badend.h"
#include "normalend.h"
#include "happyend.h"
#include "sound.h"
#include "2Dpolygon.h"
#include "ranking.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
ENDTYPE g_endType = ENDTYPE_NORMAL;		// エンディングタイプ

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitResult(void)
{
	/*** エンディングの初期化 ***/
	switch (g_endType)
	{
	// バッドエンド
	case ENDTYPE_BAD:
		FadeSound(SOUND_LABEL_BGM_BADEND);
		InitBadEnd();
		break;

	// ノーマルエンド
	case ENDTYPE_NORMAL:
		FadeSound(SOUND_LABEL_BGM_NORMALEND);
		InitNormalEnd();
		break;

	// ハッピーエンド
	case ENDTYPE_HAPPY:
		FadeSound(SOUND_LABEL_BGM_SUPERHAPPYEND);
		InitHappyEnd();
		break;

	// 例外エンド
	default:
		break;
	}

	// ランキング初期化
	InitRanking();
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitResult(void)
{
	// 2Dポリゴンの終了処理
	Uninit2DPolygon();

	// ランキングの終了
	UninitRanking();
}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateResult(void)
{
	/*** エンディングの更新 ***/
	switch (g_endType)
	{
		// バッドエンド
	case ENDTYPE_BAD:
		UpdateBadEnd();
		Update2DPolygon();
		break;

		// ノーマルエンド
	case ENDTYPE_NORMAL:
		UpdateNormalEnd();
		Update2DPolygon();
		break;

		// ハッピーエンド
	case ENDTYPE_HAPPY:
		UpdateHappyEnd();
		Update2DPolygon();
		break;

		// 例外エンド
	default:
		break;
	}

	// ランキング更新
	UpdateRanking();
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void DrawResult(void)
{
	/*** エンディングの描画 ***/
	switch (g_endType)
	{
		// バッドエンド
	case ENDTYPE_BAD:
		DrawBadEnd();
		Draw2DPolygon();
		break;

		// ノーマルエンド
	case ENDTYPE_NORMAL:
		DrawNormalEnd();
		Draw2DPolygon();
		break;

		// ハッピーエンド
	case ENDTYPE_HAPPY:
		DrawHappyEnd();
		Draw2DPolygon();
		break;

		// 例外エンド
	default:
		break;
	}

	// ランキング描画
	DrawRanking();
}

//==================================================================================
// --- エンディングタイプの指定 ---
//==================================================================================
void SetEndingType(ENDTYPE end)
{
	g_endType = end;
}