//==================================================================================
//
// DirectXのタイトル関連用のcppファイル [title.cpp]
// Author : TENMA
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "tCamera.h"
#include "mathUtil.h"

using namespace MyMathUtil;

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define MAX_TCAMERA				(1)			// カメラの最大数
#define DEFAULT_ANGLE			(45.0f)		// 視野角
#define DEFAULT_NEAR			(1.0f)		// 最近描画距離
#define DEFAULT_FAR				(1000.0f)	// 最遠描画距離

//**********************************************************************************
//*** TCam構造体 ***
//**********************************************************************************
STRUCT(TCamera)
{
	D3DVIEWPORT9 vp;				// ビューポート
	D3DXMATRIX mtxProj, mtxView;	// 各マトリックス
	D3DXVECTOR3 posV, posR, vecU;	// 視点、注視点、上方向ベクトル
	D3DXVECTOR3 rot;				// 角度
	float fLength;					// 視点間距離
	float fAngle;					// 視野角
	float fN, fF;					// 最近、最遠描画距離
	int nIdx;						// 自身のインデックス
}TCamera;

typedef TCamera *PTCAMERA, *LPTCAMERA;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
LPTCAMERA GetTCam(int nIdx = 0);

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
TCamera g_aTCam[MAX_TCAMERA];

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitTCamera(void)
{
	// 初期化
	ZeroMemory(&g_aTCam[0], sizeof(g_aTCam));
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitTCamera(void)
{
	/*** Aの終了 ***/
}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateTCamera(void)
{
	/*** Aの更新 ***/
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void SetTCamera(void)
{
	// デバイスの取得
	AUTODEVICE9 Auto;		// デバイスの自動解放用変数
	LPDIRECT3DDEVICE9 pDevice = Auto.pDevice;		// デバイスのコピー
	LPTCAMERA pTCam = GetTCam();

	// ビューポート指定
	pDevice->SetViewport(&pTCam->vp);

	// プロジェクションマトリックスの初期化
	pTCam->mtxProj = CParam::CParamEx::MTX_IDENTITY;

	// プロジェクションマトリックスを作成
	D3DXMatrixPerspectiveFovLH(&pTCam->mtxProj,
		D3DXToRadian(pTCam->fAngle),						// 視野角
		(float)pTCam->vp.Width / (float)pTCam->vp.Height,	// アスペクト比
		pTCam->fN,											// 最短描画距離
		pTCam->fF);											// 最大描画距離

	// プロジェクションマトリックスを設定
	pDevice->SetTransform(D3DTS_PROJECTION, &pTCam->mtxProj);

	// ビューマトリックスの作成
	D3DXMatrixLookAtLH(&pTCam->mtxView, &pTCam->posV, &pTCam->posR, &pTCam->vecU);

	// ビューマトリックスの設定
	pDevice->SetTransform(D3DTS_VIEW, &pTCam->mtxView);
}

//==================================================================================
// --- 追加 ---
//==================================================================================
void AddTCamera(D3DXVECTOR3 posR, D3DXVECTOR3 rot, float fLength, D3DVIEWPORT9 vp)
{
	LPTCAMERA pTCam = GetTCam();

	// 情報を保存
	pTCam->posR = posR;				// 注視点
	pTCam->rot = rot;				// 角度
	pTCam->fLength = fLength;		// 視点間距離
	pTCam->fAngle = DEFAULT_ANGLE;	// 視野角
	pTCam->nIdx = 0;				// インデックス
	pTCam->fN = DEFAULT_NEAR;		// 最近描画距離
	pTCam->fF = DEFAULT_FAR;		// 最遠描画距離

	// ビューポートを保存
	pTCam->vp = vp;

	// 各情報から視点の位置を逆算
	pTCam->posV.x = pTCam->posR.x - cosf(D3DX_PI - pTCam->rot.y) * pTCam->fLength;
	pTCam->posV.y = pTCam->posR.y;
	pTCam->posV.z = pTCam->posR.z - sinf(D3DX_PI - pTCam->rot.y) * pTCam->fLength;
}

//==================================================================================
// --- 取得 ---
//==================================================================================
LPTCAMERA GetTCam(int nIdx)
{
	return &g_aTCam[nIdx];
}