//================================================================================================================
//
// DirectXのタイトルの選択肢用のヘッダーファイル [titleSelect.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _TITLESELECT_H_
#define _TITLESELECT_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
//タイトルメニュー
typedef enum
{
	TITLE_MENU_TAP = 0,			// タップ
	TITLE_MENU_START,			// 始める
	TITLE_MENU_OPTION,			// 設定
	TITLE_MENU_OUTGAME,			// ゲームをやめる
	TITLE_MENU_ONEPLAY,			// 1人プレイ
	TITLE_MENU_TWOPLAY,			// 2人プレイ
	TITLE_MENU_MAX
}TITLE_MENU;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitTitleSelect(void);
void UninitTitleSelect(void);
void UpdateTitleSelect(void);
void DrawTitleSelect(void);

#endif