//==================================================================================
//
// DirectXのタイトルロゴ用のcppファイル [tLogo.cpp]
// Author : TENMA SAITO
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
// 基本インクルード群

// 汎用インクルード群
#include "2Dpolygon.h"
#include "param.h"

// 通常インクルード群
#include "tLogo.h"

// 名前空間の省略
using namespace MyMathUtil;
using namespace Constants;

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** ロゴ構造体 ***
//**********************************************************************************
STRUCT()
{
	D3DXVECTOR3 origin;		// 既存の位置
	D3DXVECTOR3 final;		// 最終位置
	D3DXVECTOR2 size;		// ポリゴンサイズ
	D3DXCOLOR inv, white;	// 初期カラー,最終カラ―
	IDX_TEX tex;			// テクスチャインデックス
	IDX_2DPOLYGON poly;		// ポリゴンインデックス
	float s;				// Lerp用変数
} TLogo, *LPTLOGO, *PTLOGO;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
LPTLOGO GetTLogo(void);

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
TLogo g_tLogo;						// ロゴ
const float g_fIncrease = 0.0075f;	// 増加係数

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitTLogo(void)
{
	// 初期化
	ZeroMemory(&g_tLogo, sizeof(TLogo));
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitTLogo(void)
{

}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateTLogo(void)
{
	LPTLOGO pTLogo = GetTLogo();

	// Lerp変換が終わっていない場合続行
	if (pTLogo->s >= 1.0f) return;

	// 各Lerp変換
	SetPosition2DPolygon(pTLogo->poly,
		GetPTPLerp(pTLogo->origin, pTLogo->final, pTLogo->s));

	SetColor2DPolygon(pTLogo->poly,
		GetColLerp(pTLogo->inv, pTLogo->white, pTLogo->s));

	pTLogo->s += g_fIncrease;
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void DrawTLogo(void)
{

}

//==================================================================================
// --- 設置 ---
//==================================================================================
void SetTLogo(D3DXVECTOR3 origin, D3DXVECTOR3 final, D3DXVECTOR2 size, IDX_TEX tex)
{
	LPTLOGO pTLogo = GetTLogo();

	// 値を代入
	pTLogo->origin = origin;
	pTLogo->final = final;
	pTLogo->size = size;
	pTLogo->tex = tex;
	pTLogo->inv = CParamColor::INV_WHITE;
	pTLogo->white = CParamColor::WHITE;

	// ポリゴンの設置
	Set2DPolygon(origin,
		CParamVector::V3NULL,
		size,
		tex,
		CParamColor::INV_WHITE);
}

//==================================================================================
// --- 取得 ---
//==================================================================================
LPTLOGO GetTLogo(void)
{
	return &g_tLogo;
}