//==================================================================================
//
// DirectXのチュートリアルのソースファイル [tutorial.cpp]
// Author : TENMA
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "tutorial.h"

// 基本インクルード群
#include "main.h"
#include "input.h"
#include "fade.h"
#include "sound.h"

// 汎用インクルード群
#include "Texture.h"
#include "2Dpolygon.h"
#include "mathUtil.h"
#include "param.h"

// 通常インクルード群
#include "dialog.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitTutorial(void)
{
	// テクスチャの初期化
	InitTexture();

	// 2Dポリゴンの初期化
	Init2DPolygon();
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitTutorial(void)
{
	// テクスチャの破棄
	UninitTexture();

	// 2Dポリゴンの破棄
	Uninit2DPolygon();
}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateTutorial(void)
{
	// 2Dポリゴンの更新
	Update2DPolygon();
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void DrawTutorial(void)
{
	AUTODEVICE9 AD9;

	AD9.pDevice->SetTextureStageState(0, D3DTSS_CONSTANT, D3DXCOLOR(0, 0, 0, 1));
	AD9.pDevice->SetTextureStageState(0, D3DTSS_COLOROP, D3DTOP_MODULATE);
	AD9.pDevice->SetTextureStageState(0, D3DTSS_COLORARG1, D3DTA_CONSTANT);

	// 2Dポリゴンの描画
	Draw2DPolygon();

	AD9.pDevice->SetTextureStageState(0, D3DTSS_COLOROP, D3DTOP_MODULATE);
	AD9.pDevice->SetTextureStageState(0, D3DTSS_COLORARG1, D3DTA_DIFFUSE);
}